#ifndef __MQTT_BROKER_H
#define __MQTT_BROKER_H

#include "data_type.h"

/*******************************************
 * 函数功能：创建broker的全局结构体
 * 时间：2016-09-29
 * 作者：穆昆空
 * 返回值
 *		0:创建broker成功
 *		other：创建broker失败
 *******************************************/
int broker_create(void);

/*******************************************
 * 函数功能：初始化broker的net、config、log
 			 并且创建树根、订阅子树和系统子树
 * 时间：2016-09-29
 * 作者：穆昆空
 * 返回值
 *		0:初始化成功
 *		other：初始化失败
 ******************************************/
int broker_init(void);

/*******************************************
 * 函数功能：创建监听socket
 * 时间：2016-09-29
 * 作者：穆昆空
 * 成功返回0
 *******************************************/
int broker_listen(void);

/*******************************************
 * 函数功能：循环处理监听socket和业务socket
 * 时间：2016-09-29
 * 作者：穆昆空
 * 成功返回0
 *******************************************/
int broker_start(Data_filter *mqtt_data_filter);

/*******************************************
 * 函数功能：borker异常结束，进行资源回收
 * 时间：2016-09-29
 * 作者：穆昆空
 *******************************************/
void broker_stop(void);

#endif
